/**********************************************************************
* Copyright (C) 2016 - 盛扬天下 - All Rights Reserved
*
* 文件名称:		Runnable.h
* 摘    要:		线程可运行接口
*     
* 作    者:		yanglinbo, 
* 修    改:		查看文件最下方.
* 
***********************************************************************/

#pragma once


//////////////////////////////////////////////////////////////////////////
/// 线程可运行接口
//////////////////////////////////////////////////////////////////////////
class Runnable
{
public:
	virtual ~Runnable(void) {;}

	/// 线程的入口
	virtual void run(void) = 0;
};
